/* Copyright Statement:
 *
 * (C) 2017  Airoha Technology Corp. All rights reserved.
 *
 * This software/firmware and related documentation ("Airoha Software") are
 * protected under relevant copyright laws. The information contained herein
 * is confidential and proprietary to Airoha Technology Corp. ("Airoha") and/or its licensors.
 * Without the prior written permission of Airoha and/or its licensors,
 * any reproduction, modification, use or disclosure of Airoha Software,
 * and information contained herein, in whole or in part, shall be strictly prohibited.
 * You may only use, reproduce, modify, or distribute (as applicable) Airoha Software
 * if you have agreed to and been bound by the applicable license agreement with
 * Airoha ("License Agreement") and been granted explicit permission to do so within
 * the License Agreement ("Permitted User").  If you are not a Permitted User,
 * please cease any access or use of Airoha Software immediately.
 * BY OPENING THIS FILE, RECEIVER HEREBY UNEQUIVOCALLY ACKNOWLEDGES AND AGREES
 * THAT AIROHA SOFTWARE RECEIVED FROM AIROHA AND/OR ITS REPRESENTATIVES
 * ARE PROVIDED TO RECEIVER ON AN "AS-IS" BASIS ONLY. AIROHA EXPRESSLY DISCLAIMS ANY AND ALL
 * WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NONINFRINGEMENT.
 * NEITHER DOES AIROHA PROVIDE ANY WARRANTY WHATSOEVER WITH RESPECT TO THE

 * STANDARD OR OPEN FORUM. RECEIVER'S SOLE AND EXCLUSIVE REMEDY AND AIROHA'S ENTIRE AND
 * CUMULATIVE LIABILITY WITH RESPECT TO AIROHA SOFTWARE RELEASED HEREUNDER WILL BE,
 * AT AIROHA'S OPTION, TO REVISE OR REPLACE AIROHA SOFTWARE AT ISSUE,
 * OR REFUND ANY SOFTWARE LICENSE FEES OR SERVICE CHARGE PAID BY RECEIVER TO
 * AIROHA FOR SUCH AIROHA SOFTWARE AT ISSUE.
 */

#ifndef __HAL_AUDIO_INTERNAL_H__
#define __HAL_AUDIO_INTERNAL_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "hal_audio.h"
#include "hal_audio_message_struct.h"
#include "hal_audio_nvkey_struct.h"

#ifdef HAL_DVFS_MODULE_ENABLED
#include "hal_dvfs.h"
#include "hal_dvfs_internal.h"
#endif

#ifdef HAL_AUDIO_SUPPORT_MULTIPLE_STREAM_OUT
#define PACKED __attribute__((packed))
#endif

//==== Definition ====
#define UPPER_BOUND(in,up)      ((in) > (up) ? (up) : (in))
#define LOWER_BOUND(in,lo)      ((in) < (lo) ? (lo) : (in))
#define BOUNDED(in,up,lo)       ((in) > (up) ? (up) : (in) < (lo) ? (lo) : (in))
#define MAXIMUM(a,b)            ((a) > (b) ? (a) : (b))
#define MINIMUM(a,b)            ((a) < (b) ? (a) : (b))
#define FOUR_BYTE_ALIGNED(size) (((size) + 3) & ~0x3)

typedef enum {
#ifdef HAL_DVFS_MODULE_ENABLED
    HAL_AUDIO_DVFS_UNLOCK = HAL_DVFS_UNLOCK,
    HAL_AUDIO_DVFS_LOCK   = HAL_DVFS_LOCK,
#else
    HAL_AUDIO_DVFS_UNLOCK,
    HAL_AUDIO_DVFS_LOCK,
#endif
} hal_audio_dvfs_lock_parameter_t;

typedef enum {
#ifdef HAL_DVFS_MODULE_ENABLED
    HAL_AUDIO_DVFS_DEFAULT_SPEED = HAL_DVFS_OPP_LOW,
    HAL_AUDIO_DVFS_MEDIUM_SPEED	 = HAL_DVFS_OPP_MID,
    HAL_AUDIO_DVFS_HIGH_SPEED    = HAL_DVFS_OPP_HIGH,
    HAL_AUDIO_DVFS_MAX_SPEED     = HAL_DVFS_OPP_HIGH,
#else
    HAL_AUDIO_DVFS_DEFAULT_SPEED,
    HAL_AUDIO_DVFS_MEDIUM_SPEED,
    HAL_AUDIO_DVFS_HIGH_SPEED,
    HAL_AUDIO_DVFS_MAX_SPEED,
#endif
} hal_audio_dvfs_speed_t;

#if defined(HAL_AUDIO_SUPPORT_MULTIPLE_MICROPHONE)
typedef enum {
    INPUT_DIGITAL_GAIN_FOR_DEVICE_0             = 0,            /**< input digital gain for device path.  */
    INPUT_DIGITAL_GAIN_FOR_DEVICE_1             = 1,            /**< input digital gain for device1 path.  */
    INPUT_DIGITAL_GAIN_FOR_DEVICE_2             = 2,            /**< input digital gain for device2 path.  */
    INPUT_DIGITAL_GAIN_FOR_DEVICE_3             = 3,            /**< input digital gain for device3 path.  */
    INPUT_DIGITAL_GAIN_FOR_ECHO_PATH            = 4,            /**< input digital gain for echo path.  */
    INPUT_DIGITAL_GAIN_NUM                      = 5,            /**< Specifies the number of input digital gain .  */
} afe_input_digital_gain_t;

typedef enum {
    INPUT_ANALOG_GAIN_FOR_MIC_L                 = 0,            /**< input analog gain for analog microphone L.  */
    INPUT_ANALOG_GAIN_FOR_MIC_R                 = 1,            /**< input analog gain for analog microphone R.  */
    INPUT_ANALOG_GAIN_NUM                       = 2,            /**< Specifies the number of input analog gain.  */
} afe_input_analog_gain_t;
//== hal_audio.c related ==
typedef struct {
    hal_audio_sampling_rate_t   stream_sampling_rate;                   /**< Specifies the sampling rate of audio data.*/
    hal_audio_bits_per_sample_t stream_bit_rate;                        /**< Specifies the number of bps of audio data.*/
    hal_audio_channel_number_t  stream_channel;                         /**< Specifies the number of channel.*/
    hal_audio_channel_number_t  stream_channel_mode;                    /**< Specifies the mode of channel.*/
    hal_audio_device_t          audio_device;                           /**< Specifies the device.*/
    bool                        mute;                                   /**< Specifies whether the device is mute or not.*/
    uint32_t                    digital_gain_index[INPUT_DIGITAL_GAIN_NUM];   /**< Digital gain index of the audio stream.*/
    uint32_t                    analog_gain_index[INPUT_ANALOG_GAIN_NUM];     /**< Analog gain index of the audio stream.*/
} hal_audio_stream_info_t;
#else
//== hal_audio.c related ==
typedef struct {
    hal_audio_sampling_rate_t   stream_sampling_rate;  /**< Specifies the sampling rate of audio data.*/
    hal_audio_bits_per_sample_t stream_bit_rate;       /**< Specifies the number of bps of audio data.*/
    hal_audio_channel_number_t  stream_channel;        /**< Specifies the number of channel.*/
    hal_audio_channel_number_t  stream_channel_mode;   /**< Specifies the mode of channel.*/
    hal_audio_device_t          audio_device;          /**< Specifies the device.*/
    bool                        mute;                  /**< Specifies whether the device is mute or not.*/
    uint32_t                    digital_gain_index;    /**< Digital gain index of the audio stream.*/
    uint32_t                    analog_gain_index;     /**< Analog gain index of the audio stream.*/
} hal_audio_stream_info_t;
#endif

typedef struct {
    bool                    init;
    void                    *allocated_memory;

    // stream in/out information
    hal_audio_stream_info_t stream_in;
    hal_audio_stream_info_t stream_out;
    hal_audio_stream_info_t stream_out_DL2;
    hal_audio_stream_info_t stream_out_DL3;
    hal_audio_stream_info_t stream_out_DL12;
} audio_common_t;

typedef struct {
#ifdef MTK_AUDIO_HW_IO_CONFIG_ENHANCE
    /*
        amic type:
            0x0: MEMS,
            0x1: ECM Differential,
            0x2: ECM Single,
    */
    uint8_t amic_type[8];

    /* refer to hal_audio_bias_voltage_t, it depends on the layout of the board */
    uint8_t bias_voltage[5];

    /* refer to hal_audio_bias_selection_t */
    uint8_t bias_select;/***/

    /*
        external bias enable:
            0x0: disable
            0x1: enable
    */
    uint8_t with_external_bias;

    /*
        bias lowpower enable
            0x0: disable
            0x1: enable
    */
    uint8_t with_bias_lowpower;

    /*
        bias 1/2 with LDO 0
            0x0: disable
            0x1: enable
       */
    bool bias1_2_with_LDO0;

    /* refer to hal_audio_dmic_selection_t */
    uint8_t dmic_selection[8];

    /**afe_dmic_clock_rate_t*/
    uint8_t dmic_clock_rate[3];

    /* refer to hal_audio_ul_iir_t */
    uint8_t iir_filter[3];

    /*
        uplink adc mode
            0x0: ACC_10k
            0x1: ACC_20k
            0x2: DCC
    */
    uint8_t ul_adc_mode[8];
#endif

    /* refer to hal_audio_analog_mdoe_t */
    hal_audio_analog_mdoe_t adc_mode;

    /* refer to hal_audio_performance_mode_t */
    hal_audio_performance_mode_t performance;
} hal_audio_mic_config_t;

//== hal_audio_dsp_controller.c related ==
typedef struct {
    uint32_t mState;
    int32_t  mUserCount;
} audiosys_clkmux_control;

typedef enum {
    AUDIO_CLKMUX_BLOCK_INTERNAL_BUS = 0,
    AUDIO_CLKMUX_BLOCK_DOWNLINK_HIRES,
    AUDIO_CLKMUX_BLOCK_UPLINK_HIRES,
    AUDIO_CLKMUX_BLOCK_HW_SRC,
    AUDIO_CLKMUX_BLOCK_NUM_OF_CLKMUX_BLOCK,
} audio_clkmux_block_t;

/** @brief audio structure */
#ifdef HAL_AUDIO_SUPPORT_MULTIPLE_STREAM_OUT
typedef enum {
    AU_DSP_AUDIO      = 0,
    AU_DSP_VOICE      = 1,
    AU_DSP_ANC        = 2,
    AU_DSP_RECORD     = 3,
    AU_DSP_VAD_PHASE0 = 4,
    AU_DSP_VAD_PHASE1 = 5,
    AU_DSP_LINEIN     = 6,
    AU_DSP_SIDETONE   = 7,
} audio_scenario_sel_t;
typedef enum {
    AU_DSP_CH_LR = 0,       /**< */
    AU_DSP_CH_L,            /**< */
    AU_DSP_CH_R,            /**< */
    AU_DSP_CH_SWAP,         /**< */
    AU_DSP_CH_MIX,
    AU_DSP_CH_MIX_SHIFT,
} audio_channel_sel_t;

typedef enum {
    SDK_NONE   = 0x0000,
    SDK_V1p3   = 0x0001,
    SDK_V1p4   = 0x0002,
} audio_version_t;

typedef struct HAL_AUDIO_CH_SEL_HW_MODE_s
{
    uint8_t                     audioChannelGPIOH;      /**< Channel select when GPIO is high. 0:None, 1:L CH, 2:R CH, 3:Two CH*/
    uint8_t                     audioChannelGPIOL;      /**< Channel select when GPIO is low.  0:None, 1:L CH, 2:R CH, 3:Two CH*/
    uint8_t                     gpioIndex;              /**< GPIO index for audio channel select in HW mode. */
} PACKED HAL_AUDIO_CH_SEL_HW_MODE_t;

/*############################################Audio part######################################*/
typedef struct HAL_DSP_PARA_AU_AFE_AUDIO_SCENARIO_s {
    uint8_t Audio_Linein_Input_Path; //0x0: Line-In,0x1: I2S_Master_In,0x2: I2S_Slave_In
    uint8_t Audio_A2DP_Output_Path; //0x0: Analog_SPK_Out_L,0x1: Analog_SPK_Out_R,0x2: Analog_SPK_Out_DUAL, 0x3: I2S_Master_Out,0x4: I2S_Slave_Out
    uint8_t Audio_Linein_Input_I2S_Interface; //0x0: I2S_0,0x1: I2S_1,0x2: I2S_2,0x3: I2S_3,
    uint8_t Audio_A2DP_Output_I2S_Interface; //0x0: I2S_0,0x1: I2S_1,0x2: I2S_2,0x3: I2S_3,
    uint8_t Audio_I2S_CLK_Src_In_Normal; //0x0: DCXO,0x1: APLL,
    uint8_t Audio_Analog_LineIn_Performance_Sel; //x0: Normal_Mode,0x1: High_Performance,0x2: Low_Power_mode,0x3: Ultra_Low_Power_mode,0x4: Super_Ultra_Low_Power_mode,
    /*
        bit mask to enable Bias
        8'b 00000001: Bias 0,
        8'b 00000010: Bias 1,
        8'b 00000100: Bias 2,
        8'b 00001000: Bias 3,
        8'b 00010000: Bias 4,
        could support MAX 8 MIC bias setting
    */
    uint8_t Audio_LineIn_Bias_Enable;
    uint8_t Audio_LineIn_bias_low_power_Enable;

    uint8_t Audio_Linein_Output_Path;//0x0: Analog_SPK_Out_L,0x1: Analog_SPK_Out_R,0x2: Analog_SPK_Out_DUAL, 0x3: I2S_Master_Out,0x4: I2S_Slave_Out
    uint8_t Audio_Linein_Output_I2S_Interface; //0x0: I2S_0,0x1: I2S_1,0x2: I2S_2,0x3: I2S_3,
    uint8_t Audio_Pure_Linein_enable; //0x0:disable,0x1,enable
    /*
        0, by scenario
        1, fix 48000Hz
        2, fix 96000Hz
    */
    uint8_t Audio_I2S0_Master_Sampling_Rate;
    uint8_t Audio_I2S1_Master_Sampling_Rate;
    uint8_t Audio_I2S2_Master_Sampling_Rate;
    uint8_t Audio_I2S3_Master_Sampling_Rate;

    uint8_t Audio_Reserved[2];
}PACKED HAL_DSP_PARA_AU_AFE_AUDIO_SCENARIO_t;


/*############################################Voice part#############################################*/
typedef struct HAL_DSP_PARA_AU_AFE_VOICE_SCENARIO_s {
    uint8_t Voice_Input_Path; //0x0: Analog Mic,0x1: Digital Mic,0x2: I2S_Master_In,0x3: I2S_Slave_In,0x4: Multiple_Mic_Configuration
    uint8_t Voice_Output_Path; //0x0: Analog_SPK_Out_L,0x1: Analog_SPK_Out_R,0x2: Analog_SPK_Out_DUAL,0x3: I2S_Master_Out,0x4: I2S_Slave_Out
    uint8_t Voice_Input_I2S_Interface; //0x0: I2S_0,0x1: I2S_1,0x2: I2S_2,0x3: I2S_3,
    uint8_t Voice_Output_I2S_Interface; //0x0: I2S_0,0x1: I2S_1,0x2: I2S_2,0x3: I2S_3,
    uint8_t Voice_I2S_CLK_Src_In_Normal; //0x0: DCXO,0x1: APLL,
    uint8_t Voice_Input_DMIC_channel; //0x0: Mic_L,0x1: Mic_R,0x2: Mic_DUAL,0x3: None
    uint8_t Voice_Input_AMIC_channel; //0x0: Mic_L,0x1: Mic_R,0x2: Mic_DUAL,0x3: None
    uint8_t Voice_Analog_ADC_Performance_Sel;//x0: Normal_Mode,0x1: High_Performance,0x2: Low_Power_mode,0x3: Ultra_Low_Power_mode,0x4: Super_Ultra_Low_Power_mode,
    uint8_t Voice_Analog_MIC_Sel; //0x0: 0x0: Analog_Mic0 (AU_VIN0 & AU_VIN1),0x1: Analog_Mic1 (AU_VIN2 & AU_VIN3),0x2: Analog_Mic2 (AU_VIN4 & AU_VIN5),
    uint8_t Voice_Digital_MIC_Sel; //0x0: First_DMIC,0x1: Second_DMIC,0x02:third_DMIC
    /*
        bit mask to enable Bias
        8'b 00000001: Bias 0,
        8'b 00000010: Bias 1,
        8'b 00000100: Bias 2,
        8'b 00001000: Bias 3,
        8'b 00010000: Bias 4,
        could support MAX 8 MIC bias setting
    */
    uint8_t Voice_MIC_Bias_Enable;
    uint8_t Voice_mic_bias_low_power_Enable;

    uint8_t Voice_Side_Tone_Enable; //0x0: disable,0x1: enable,

     /* 0x00: Analog_Mic0_L,0x01: Analog_Mic0_R,0x02: Analog_Mic1_L,0x03: Analog_Mic1_R,
        0x04: Analog_Mic2_L,0x05: Analog_Mic2_R,0x08: First_DMic_L,0x09: First_DMic_R,
        0x0A: Second_DMic_L,0x0B: Second_DMic_R,0x0C: Third_DMic_L,0x0D: Third_DMic_R,

        0x10: I2S0_Master_L,0x20: I2S0_Master_R,0x30: I2S1_Master_L,0x40: I2S1_Master_R,
        0x50: I2S2_Master_L,0x60: I2S2_Master_R,0x80: I2S0_Slave_L,0x90: I2S0_Slave_R,
        0xA0: I2S1_Slave_L,0xB0: I2S1_Slave_R, 0xC0: I2S2_Slave_L,0xD0: I2S2_Slave_R,
        0xFF: None.
    */
    uint8_t Voice_Multiple_Mic_Main_Input_Select;
    uint8_t Voice_Multiple_Mic_Ref1_Input_Select;
    uint8_t Voice_Multiple_Mic_Ref2_Input_Select;
    uint8_t Voice_Multiple_Mic_Ref3_Input_Select;
    uint8_t Voice_Multiple_Mic_Ref4_Input_Select;
    uint8_t Voice_Multiple_Mic_Ref5_Input_Select;
    /*
        0, by scenario
        1, fix 48000Hz
        2, fix 96000Hz
    */
    uint8_t Voice_I2S0_Master_Sampling_Rate;
    uint8_t Voice_I2S1_Master_Sampling_Rate;
    uint8_t Voice_I2S2_Master_Sampling_Rate;
    uint8_t Voice_I2S3_Master_Sampling_Rate;
    uint8_t Voice_Reserved[2];
}PACKED HAL_DSP_PARA_AU_AFE_VOICE_SCENARIO_t;

/*############################################Record part############################################*/
typedef struct HAL_DSP_PARA_AU_AFE_RECORD_SCENARIO_s {
     /* 0x00: Analog_Mic0_L,0x01: Analog_Mic0_R,0x02: Analog_Mic1_L,0x03: Analog_Mic1_R,
        0x04: Analog_Mic2_L,0x05: Analog_Mic2_R,0x08: First_DMic_L,0x09: First_DMic_R,
        0x0A: Second_DMic_L,0x0B: Second_DMic_R,0x0C: Third_DMic_L,0x0D: Third_DMic_R,

        0x10: I2S0_Master_L,0x20: I2S0_Master_R,0x30: I2S1_Master_L,0x40: I2S1_Master_R,
        0x50: I2S2_Master_L,0x60: I2S2_Master_R,0x80: I2S0_Slave_L,0x90: I2S0_Slave_R,
        0xA0: I2S1_Slave_L,0xB0: I2S1_Slave_R, 0xC0: I2S2_Slave_L,0xD0: I2S2_Slave_R,
        0xFF: None.
    */
    uint8_t Record_Main_Input_Select;
    uint8_t Record_Ref_Input_Select;
    uint8_t Record_Ref2_Input_Select;
    uint8_t Record_Ref3_Input_Select;
    uint8_t Record_Ref4_Input_Select;
    uint8_t Record_Ref5_Input_Select;

    /*
        bit mask to enable Bias
        8'b 00000001: Bias 0,
        8'b 00000010: Bias 1,
        8'b 00000100: Bias 2,
        8'b 00001000: Bias 3,
        8'b 00010000: Bias 4,
        could support MAX 8 MIC bias setting*/
    uint8_t Record_MIC_Bias_Enable;

    uint8_t Record_Side_Tone_Enable;  //0x0: disable,0x1: enable,
    uint8_t Record_Analog_ADC_Performance_Sel; //x0: Normal_Mode,0x1: High_Performance,0x2: Low_Power_mode,0x3: Ultra_Low_Power_mode,0x4: Super_Ultra_Low_Power_mode,
    uint8_t Record_Reserved[7];
}PACKED HAL_DSP_PARA_AU_AFE_RECORD_SCENARIO_t;

/*############################################VAD part############################################*/
typedef struct HAL_DSP_PARA_AU_AFE_VAD_SCENARIO_s {
    /*  0x00: Analog_Mic0_L,0x01: Analog_Mic0_R,0x02: Analog_Mic1_L,0x03: Analog_Mic1_R,
        0x04: Analog_Mic2_L,0x05: Analog_Mic2_R,0x08: First_DMic_L,0x09: First_DMic_R,
        0x0A: Second_DMic_L,0x0B: Second_DMic_R,0x0C: Third_DMic_L,0x0D: Third_DMic_R,

        0x10: I2S0_Master_L,0x20: I2S0_Master_R,0x30: I2S1_Master_L,0x40: I2S1_Master_R,
        0x50: I2S2_Master_L,0x60: I2S2_Master_R,0x80: I2S0_Slave_L,0x90: I2S0_Slave_R,
        0xA0: I2S1_Slave_L,0xB0: I2S1_Slave_R, 0xC0: I2S2_Slave_L,0xD0: I2S2_Slave_R,
        0xFF: None.
    */
    uint8_t VAD_phase0_Main_Input_Select;
    uint8_t VAD_phase0_Ref_Input_Select;
    uint8_t VAD_phase1_Main_Input_Select;
    uint8_t VAD_phase1_Ref_Input_Select;

    /*
        bit mask to enable Bias
        8'b 00000001: Bias 0,
        8'b 00000010: Bias 1,
        8'b 00000100: Bias 2,
        8'b 00001000: Bias 3,
        8'b 00010000: Bias 4,
        could support MAX 8 MIC bias setting*/
    uint8_t VAD_MIC_Bias_Enable;

    uint8_t VAD_Side_Tone_Enable; //0x0:disable,0x1:enable,
    uint8_t VAD_Analog_ADC_Performance_Sel; //x0:Normal_Mode,0x1:High_Performance,0x2:Low_Power_mode,0x3:Ultra_Low_Power_mode,0x4:Super_Ultra_Low_Power_mode,
    uint8_t VAD_phase1_Ref2_Input_Select;
    uint8_t VAD_phase1_Ref3_Input_Select;
    uint8_t VAD_phase1_Ref4_Input_Select;
    uint8_t VAD_phase1_Ref5_Input_Select;
    uint8_t VAD_Reserved[1];
}PACKED HAL_DSP_PARA_AU_AFE_VAD_SCENARIO_t;

typedef struct HAL_DSP_PARA_AU_AFE_DETACH_MIC_SCENARIO_s {
    /*  0x00: Analog_Mic0_L,0x01: Analog_Mic0_R,0x02: Analog_Mic1_L,0x03: Analog_Mic1_R,
        0x04: Analog_Mic2_L,0x05: Analog_Mic2_R,0x08: First_DMic_L,0x09: First_DMic_R,
        0x0A: Second_DMic_L,0x0B: Second_DMic_R,0x0C: Third_DMic_L,0x0D: Third_DMic_R,

        0x10: I2S0_Master_L,0x20: I2S0_Master_R,0x30: I2S1_Master_L,0x40: I2S1_Master_R,
        0x50: I2S2_Master_L,0x60: I2S2_Master_R,0x80: I2S0_Slave_L,0x90: I2S0_Slave_R,
        0xA0: I2S1_Slave_L,0xB0: I2S1_Slave_R, 0xC0: I2S2_Slave_L,0xD0: I2S2_Slave_R,
        0xFF: None.
    */
    uint8_t Detach_MIC_Select;

    /*
        bit mask to enable Bias
        8'b 00000001: Bias 0,
        8'b 00000010: Bias 1,
        8'b 00000100: Bias 2,
        8'b 00001000: Bias 3,
        8'b 00010000: Bias 4,
        could support MAX 8 MIC bias setting*/
    uint8_t Detach_MIC_Bias_Enable;

    uint8_t Detach_MIC_Side_Tone_Enable; //0x0:disable,0x1:enable,
    uint8_t Detach_MIC_Analog_ADC_Performance_Sel; //x0:Normal_Mode,0x1:High_Performance,0x2:Low_Power_mode,0x3:Ultra_Low_Power_mode,0x4:Super_Ultra_Low_Power_mode,
    uint8_t Detach_MIC_Select2;
    uint8_t Detach_MIC_Reserved[3];
}PACKED HAL_DSP_PARA_AU_AFE_DETACH_MIC_SCENARIO_t;

typedef struct HAL_DSP_PARA_AU_AFE_ANC_SCENARIO_s {
    /*
        bit mask to enable Bias
        8'b 00000001: Bias 0,
        8'b 00000010: Bias 1,
        8'b 00000100: Bias 2,
        8'b 00001000: Bias 3,
        8'b 00010000: Bias 4,
        could support MAX 8 MIC bias setting*/
    uint8_t ANC_MIC_Bias_Enable;

    uint8_t ANC_MIC_Analog_ADC_Performance_Sel; //x0:Normal_Mode,0x1:High_Performance,0x2:Low_Power_mode,0x3:Ultra_Low_Power_mode,0x4:Super_Ultra_Low_Power_mode,
    uint8_t ANC_Reserved[2];
}PACKED HAL_DSP_PARA_AU_AFE_ANC_SCENARIO_t;

typedef struct HAL_DSP_PARA_AU_AFE_PASSTHROUGH_SCENARIO_s {
    /*
        bit mask to enable Bias
        8'b 00000001: Bias 0,
        8'b 00000010: Bias 1,
        8'b 00000100: Bias 2,
        8'b 00001000: Bias 3,
        8'b 00010000: Bias 4,
        could support MAX 8 MIC bias setting*/
    uint8_t Passthrough_MIC_Bias_Enable;

    uint8_t Passthrough_MIC_Analog_ADC_Performance_Sel; //x0:Normal_Mode,0x1:High_Performance,0x2:Low_Power_mode,0x3:Ultra_Low_Power_mode,0x4:Super_Ultra_Low_Power_mode,
    uint8_t Passthrough_Reserved[2];
}PACKED HAL_DSP_PARA_AU_AFE_PASSTHROUGH_SCENARIO_t;

/*############################################ADC DAC config part####################################*/
typedef struct HAL_DSP_PARA_AU_AFE_ADC_DAC_CONFIG_s {
    uint8_t ADDA_DAC_Output_Channel; // 0x1: Analog_SPK_Out_L, 0x2: Analog_SPK_Out_R,x3: Analog_SPK_Out_DUAL
    uint8_t ADDA_DAC_Mode_Sel; //0x0: Class_G2,0x1: Class_AB,0x2: Class_D,0x3: Class_G3, 0x4: OL_Class_D,
    uint8_t ADDA_DAC_Class_AB_G_Performance_Sel; //0x0: Normal_Mode,0x1: High_Performance,0x2: Low_Performance

    /*  0x0: 1.8V,
        0x1: 2.78V,
        0x2: 1.9V,
        0x3: 2.0V,
        0x4: 2.1V,
        0x5: 2.2V,
        0x6: 2.4V,
        0x7: 2.55V,
    */
    uint8_t ADDA_Voice_Bias4_Level;
    uint8_t ADDA_Voice_Bias3_Level;
    uint8_t ADDA_Voice_Bias2_Level;
    uint8_t ADDA_Voice_Bias1_Level;
    uint8_t ADDA_Voice_Bias0_Level;

    /*  Bias 0 1 2 share with one LDO HW
    */
    uint8_t ADDA_Voice_Bias012_share_LDO;


    /*
        0x0: ACC_10k,
        0x1: ACC_20k,
        0x2: DCC,
    */
    uint8_t ADDA_Analog_MIC0_Mode;

    /*  0x0: Differential,
        0x1: Single,
    */
    uint8_t ADDA_Analog_MIC0_Type;

    uint8_t ADDA_Analog_MIC1_Mode;
    uint8_t ADDA_Analog_MIC1_Type;

    uint8_t ADDA_Analog_MIC2_Mode;
    uint8_t ADDA_Analog_MIC2_Type;

    uint8_t ADDA_Analog_MIC3_Mode;
